w7/w7d1/app/controllers/toys_controller.rb

  def show
    @toy = Toy.find(params[:id])
---
SELECT  "toys".* FROM "toys"  WHERE "toys"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @toy = Toy.find(params[:id])
    if @toy.update(toy_params)
---
SELECT  "toys".* FROM "toys"  WHERE "toys"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "toys" SET "pokemon_id" = $1, "updated_at" = $2 WHERE "toys"."id" = 1  [["pokemon_id", 7], ["updated_at", "2015-01-26 23:48:49.756490"]]